app/Http/Controllers/QuestionsController.php

select * from `questions` order by `created_at` desc limit 5 offset 0
select * from `users` where `users`.`id` in (2)
select count(*) as aggregate from `questions`
---
    public function index()
    {
        $questions = Question::with('user')->latest()->paginate(5);

update `questions` set `views` = `views` + 1, `questions`.`updated_at` = '2020-02-26 08:54:36' where `id` = 2
---
    public function show(Question $question)
    {
        $question->increment('views');

update `questions` set `title` = 'this is my first ( updated ) question', `slug` = 'this-is-my-first-updated-question', `questions`.`updated_at` = '2020-02-22 06:13:43' where `id` = 8
---
    public function update(AskQuestionRequest $request, Question $question)
    {
        if(\Gate::denies('update-question', $question))
        {
            abort(403, 'Access denied');
        }
        $question->update($request->only('title', 'body'));

delete from `questions` where `id` = 8
---
    public function destroy(Question $question)
    {
        if(\Gate::denies('delete-question', $question))
        {
            abort(403, 'Access denied');
        }
        $question->delete();