app/Providers/RouteServiceProvider.php

select * from `questions` where `slug` = 'harum-officia-in-consequuntur-facilis-voluptatem-autem-consequatur-et' limit 1
---
    public function boot()
    {
        //
        Route::bind('slug', function($slug){
            return Question::where('slug', $slug)->first() ?? abort(404);